package ru.tinkoff.fintech.refactoring

// Здесь кажется логичным вариантом было бы использовать map для хранения ингредиентов

object PizzaIngredients {

//    val ingredientsList = mapOf("яйца" to 3.48,
//    "бекон" to 6.48,
//    "тесто" to 1.00,
//    "томат" to 1.53,
//    "оливки" to 1.53,
//    "сыр" to 0.98,
//    "пармезан" to 3.98,
//    "грибы" to 3.34,
//    "спаржа" to 3.34,
//    "мясное ассорти" to 9.38,
//    "вяленая говядина" to 12.24)

    fun getIngredients(ingredientName : String): Double {
        return when (ingredientName) {
            "яйца" -> 3.48
            "бекон" -> 6.48
            "тесто" -> 1.00
            "томат" -> 1.53
            "оливки" -> 1.53
            "сыр" -> 0.98
            "пармезан" -> 3.98
            "грибы" -> 3.34
            "спаржа" -> 3.34
            "мясное ассорти" -> 9.38
            "вяленая говядина" -> 12.24
            else -> error("Неизвестный ингредиент")
        }
    }

}